List<String> maincateg = [
  'select category',
  'shop',
  'shop2',
  'furniture',
  'finishingsupplies',
  'clothesandshoes',
  'service',
  'medicalservices',
  'car',
  'education',
  'carsservice',
  // 'shopsrent',
  'freeprofessions',
  'doctor',
  'primarystage',
  'middleschool',
  'highschool',

];


List<String> shop = [
  'subcategory',
  'سوبر ماركت',
  'مجمدات',
  'معرض حلويات',
  'دواجن واعلاف',
  'جزارة',
  'أسماك',
  'عطاره وتسالي ',
  'المزيد',
];
List<String> shop2 = [
  'subcategory',
  'مطاعم وكافيهات',
  'موبايلات وكمبيوتر',
  'عطور وبرفانات',
  'مستحضرات تجميل',
  'مكتبات وهدايا',
  'نظرات وبصريات',
  'لوازم المنزل',
  'منظفات وبلاستيكات',
  'ورش ومصانع',
  'أنظمة أمنية وكاميرات',
  'مبيدات زراعية',
  'المزيد',
];
List<String> furniture = [
  'subcategory',
  'أثاث',
  'ستائر',
  'سجاد ',
  'المزيد',
];
List<String> finishingsupplies = [
  'subcategory',
  'كهرباء',
  'حدايد وبويات',
  'أدوات صحية وسيراميك',
  'مواد بناء',
  'المزيد',
];
List<String> clothesandshoes = [
  'subcategory',
  'أحذية وشنط',
  'ملابس رياضية',
  'حريمي وأطفال',
  'تفصيل وخياطه',
  'ملابس رجالي',
  'المزيد',
];
List<String> service = [
  'subcategory',
  'جمعيات خيرية',
  'تحفيظ القرآن',
  'محامين',
  'مهندسين',
  'دعاية وإعلان',
  'تصوير فوتوغرافي',
  'تكييفات وتبريد',
  'دراي كلين ومغسلة',
  'نادي رياضي',
  'أماكن ترفيه',
  'قاعات وتنظيم حفلات',
  'صالون رجالى',
  'ميكب أرتست',
  'المزيد',
];
List<String> medicalservices = [
  'subcategory',
  'صيدليات',
  'معامل تحاليل',
  'تمريض',
  'مستشفيات',
  'مراكز أشعة',
  'المزيد',
];
List<String> car = [
  'subcategory',
  'توك توك',
  'سيارات ايجار',
  'ميكروباص وأجره',
  'تروسيكل',
  'شركات السياحة',
  'معدات للايجار',
  'مكاتب نقل وتخليص جمركي',
  'شركات الباص',
  'عربة ربع نقل',
  'عربة نصف نقل',
  'المزيد',

];
List<String> education = [
  'subcategory',
  'المرحلة الابتدائية',
  'المرحلة الإعدادية',
  'المرحلة الثانوية',
  'المزيد'
];
List<String> freeprofessions = [
  'subcategory',
  'بنا',
  'جبسوم بورد ومحاره',
  'زجاج والمونتال',
  'سباك',
  'صيانة أجهزة كهربائية',
  'عامل',
  'فراشة الحفلات',
  'كهربائي',
  'مبلط',
  'نجار',
  'نقاش واستورجي',
  'ورشة حدادة',
  'المزيد',
];

List<String> doctor = [
  'subcategory',
  'أنف وأذن وحنجرة',
  'دكتور أسنان',
  'دكتور أطفال',
  'دكتور باطنه',
  'دكتور بيطري',
  'دكتور جراح',
  'دكتور جلدية',
  'دكتور سمنه وتخسيس',
  'دكتور صدر',
  'دكتور عظام',
  'دكتور عيون',
  'دكتور مخ واعصاب',
  'دكتور مسالك بولية',
  'دكتور نساء وتوليد',
  'المزيد',
];
List<String> carsservice = [
  'subcategory',
  'جراج',
  'اطارت وزيوت',
  'صيانة السيارات',
  'فسفور وزينه سيارات',
  'قطع غيار سيارات',
  'معارض سيارات',
  'مغاسل سيارات',
  'المزيد',
];
List<String> primarystage = [
  'subcategory',
  'اللغة الإنجليزية',
  'الدراسات',
  'الرياضيات',
  'اللغة العربية',
  'العلوم',
  'تكنولوجيا المعلومات',
];
List<String> middleschool = [
  'subcategory',
  'اللغة الإنجليزية',
  'الدراسات',
  'الرياضيات',
  'اللغة العربية',
  'العلوم',
  'تكنولوجيا المعلومات',
];
List<String> highschool = [
  'subcategory',
  'اللغة الإنجليزية',
  'الأحياء',
  'التاريخ والجغرافيا',
  'الجولوجيا',
  'الرياضيات',
  'اللغة العربية',
  'اللغة الفرنسية',
  'الكيمياء',
  'الفيزياء',
];









